app/commands/authorize_api_request.rb

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def user
    @user ||= Host.find(decoded_auth_token[:host_id]) if decoded_auth_token