app/commands/authenticate_user.rb

SELECT "hosts".* FROM "hosts" WHERE "hosts"."email" = $1 LIMIT $2  [["email", "johnsmith5371@gmail.com"], ["LIMIT", 1]]
---
  def user
    host = Host.find_by_email(email)