app/controllers/api/v1/host/registrations_controller.rb

      def create
        @host_sign_up = Host.create(host_params)
---
INSERT INTO "hosts" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"