app/controllers/api/v1/host/sessions_controller.rb

  def create
    command = AuthenticateUser.call(params[:email], params[:password])
    if command.success?
      @host_sign_in = Host.where(email: params[:email].downcase).first
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."email" = $1 ORDER BY "hosts"."id" ASC LIMIT $2  [["email", "fakeeail18@gmail.com"], ["LIMIT", 1]]