app/controllers/api/v1/events_controller.rb

  def create
    #Get user
    @user = AuthorizeApiRequest.call(params).result
    @event = @user.event.create(event_params)
    if @event.save
---
INSERT INTO "events" ("host_id", "title", "description", "type_id", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def host_events
    @user = AuthorizeApiRequest.call(params).result
    @host_events = Event.where(host_id: @user.id)
---
SELECT "events".* FROM "events" WHERE "events"."host_id" = $1  [["host_id", 1]]